
## Plan Result (feature-flags-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/21928)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * local_file.application_ecs_service_appspec_94386B9C


<details><summary>Change Result (Click me)</summary>

```hcl

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = jsonencode(
            {
              + Resources = [
                  + {
                      + TargetService = {
                          + Properties = {
                              + LoadBalancerInfo = {
                                  + ContainerName = "app"
                                  + ContainerPort = 4242
                                }
                              + TaskDefinition   = "arn:aws:ecs:us-east-1:996905175585:task-definition/FeatureFlags-Prod:281"
                            }
                          + Type       = "AWS::ECS::Service"
                        }
                    },
                ]
              + version   = 1
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"c6530b6f-c490-40c2-b891-23329c41ee8c","JobName":"feature-flags_infrastructure_plan_prod","PRNumber":94,"Program":"tfcmt","SHA1":"c6ea51dc1d56d05a6ae70588027bb37c25fc429e","Target":"feature-flags-cdk","Vars":{}} -->